Public Attributes | List of all members
API_AnalyticalMemberPartRef Struct Reference
Analytical Model
Describes a Structural Analytical Model Analytical Member part. More...
#include <APIdefs_AnalyticalElements.h>
 Public Attributes
API_Guid  | elemGuid
The references Structural Analytical Model Member.
API_AnalyticalMemberPartRefType  | partRefType
The type of the reference.
API_InternalAnalyticalMemberPartId  | partId
Identifies the edge or the vertex.
API_AMPartRefCustomVertexData  | customVertexData
Contains the vertex coordinate when partRefType is API_AMPartRef_CustomVertex.
API_AMPartRefRatioEdgeData  | ratioEdgeData
Contains the ratios when partRefType is API_AMPartRef_RatioEdge.
Detailed Description
Describes a Structural Analytical Model Analytical Member part.
Since
Archicad 25
Member Data Documentation
◆ customVertexData
 API_AnalyticalMemberPartRef::customVertexData
Contains the vertex coordinate when partRefType is API_AMPartRef_CustomVertex.
◆ elemGuid
 API_AnalyticalMemberPartRef::elemGuid
The references Structural Analytical Model Member.
◆ partId
 API_AnalyticalMemberPartRef::partId
Identifies the edge or the vertex.
◆ partRefType
 API_AnalyticalMemberPartRef::partRefType
The type of the reference.
◆ ratioEdgeData
 API_AnalyticalMemberPartRef::ratioEdgeData
Contains the ratios when partRefType is API_AMPartRef_RatioEdge.